## 불린 인덱싱

In [1]:
import seaborn as sns
import pandas as pd

In [2]:
titanic = sns.load_dataset('titanic')

In [3]:
mask1 = (titanic.age >= 10) & (titanic.age < 20)
df_teenage = titanic.loc[mask1, :]
print(df_teenage)

     survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
9           1       2  female  14.0      1      0   30.0708        C  Second
14          0       3  female  14.0      0      0    7.8542        S   Third
22          1       3  female  15.0      0      0    8.0292        Q   Third
27          0       1    male  19.0      3      2  263.0000        S   First
38          0       3  female  18.0      2      0   18.0000        S   Third
..        ...     ...     ...   ...    ...    ...       ...      ...     ...
853         1       1  female  16.0      0      1   39.4000        S   First
855         1       3  female  18.0      0      1    9.3500        S   Third
875         1       3  female  15.0      0      0    7.2250        C   Third
877         0       3    male  19.0      0      0    7.8958        S   Third
887         1       1  female  19.0      0      0   30.0000        S   First

       who  adult_male deck  embark_town alive  alone
9    child       False  NaN    Cherbourg   yes  False
14   child       False  NaN  Southampton    no   True
22   child       False  NaN   Queenstown   yes   True
27     man        True    C  Southampton    no  False
38   woman       False  NaN  Southampton    no  False
..     ...         ...  ...          ...   ...    ...
853  woman       False    D  Southampton   yes  False
855  woman       False  NaN  Southampton   yes  False
875  child       False  NaN    Cherbourg   yes   True
877    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True

[102 rows x 15 columns]

## isin() 메소드 활용

In [4]:
pd.set_option('display.max_columns', 10)

In [5]:
mask3 = titanic['sibsp'] ==3
mask4 = titanic['sibsp'] ==4
mask5 = titanic['sibsp'] ==5

df_boolean = titanic[mask3 | mask4 | mask5]
print(df_boolean.head())

    survived  pclass     sex   age  sibsp  ...  adult_male  deck  embark_town  \
7          0       3    male   2.0      3  ...       False   NaN  Southampton
16         0       3    male   2.0      4  ...       False   NaN   Queenstown
24         0       3  female   8.0      3  ...       False   NaN  Southampton
27         0       1    male  19.0      3  ...        True     C  Southampton
50         0       3    male   7.0      4  ...       False   NaN  Southampton

   alive  alone
7     no  False
16    no  False
24    no  False
27    no  False
50    no  False

[5 rows x 15 columns]

In [6]:
isin_filter = titanic['sibsp'].isin([3,4,5])
df_isin = titanic[isin_filter]
print(df_isin.head())

    survived  pclass     sex   age  sibsp  ...  adult_male  deck  embark_town  \
7          0       3    male   2.0      3  ...       False   NaN  Southampton
16         0       3    male   2.0      4  ...       False   NaN   Queenstown
24         0       3  female   8.0      3  ...       False   NaN  Southampton
27         0       1    male  19.0      3  ...        True     C  Southampton
50         0       3    male   7.0      4  ...       False   NaN  Southampton

   alive  alone
7     no  False
16    no  False
24    no  False
27    no  False
50    no  False

[5 rows x 15 columns]